results/results_old/data/run1/native-db/erik-laptop/quarkus-worker-pool-16000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 417.676ms, rate sampling interval: 1311ms
  Thread calibration: mean lat.: 221.934ms, rate sampling interval: 892ms
  Thread calibration: mean lat.: 283.002ms, rate sampling interval: 1111ms
  Thread calibration: mean lat.: 385.843ms, rate sampling interval: 1359ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.88s   903.07ms   4.85s    62.98%
    Req/Sec     3.79k   239.20     4.38k    64.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.83s 
 75.000%    2.51s 
 90.000%    3.14s 
 99.000%    3.98s 
 99.900%    4.53s 
 99.990%    4.77s 
 99.999%    4.81s 
100.000%    4.85s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.029     0.000000            1         1.00
     734.207     0.100000        75571         1.11
     993.279     0.200000       151067         1.25
    1270.783     0.300000       226462         1.43
    1554.431     0.400000       302009         1.67
    1827.839     0.500000       377666         2.00
    1945.599     0.550000       415279         2.22
    2080.767     0.600000       452985         2.50
    2213.887     0.650000       491095         2.86
    2353.151     0.700000       528412         3.33
    2512.895     0.750000       566227         4.00
    2603.007     0.775000       585104         4.44
    2693.119     0.800000       604019         5.00
    2793.471     0.825000       622794         5.71
    2891.775     0.850000       641635         6.67
    2998.271     0.875000       660511         8.00
    3067.903     0.887500       670035         8.89
    3137.535     0.900000       679491        10.00
    3213.311     0.912500       688917        11.43
    3293.183     0.925000       698243        13.33
    3368.959     0.937500       707750        16.00
    3414.015     0.943750       712520        17.78
    3467.263     0.950000       717138        20.00
    3532.799     0.956250       721835        22.86
    3594.239     0.962500       726530        26.67
    3672.063     0.968750       731295        32.00
    3706.879     0.971875       733665        35.56
    3741.695     0.975000       736076        40.00
    3778.559     0.978125       738429        45.71
    3825.663     0.981250       740769        53.33
    3872.767     0.984375       743122        64.00
    3897.343     0.985938       744295        71.11
    3926.015     0.987500       745474        80.00
    3958.783     0.989062       746630        91.43
    3999.743     0.990625       747773       106.67
    4040.703     0.992188       748971       128.00
    4059.135     0.992969       749536       142.22
    4081.663     0.993750       750156       160.00
    4106.239     0.994531       750737       182.86
    4134.911     0.995313       751300       213.33
    4167.679     0.996094       751895       256.00
    4186.111     0.996484       752211       284.44
    4202.495     0.996875       752478       320.00
    4231.167     0.997266       752803       365.71
    4263.935     0.997656       753070       426.67
    4317.183     0.998047       753368       512.00
    4349.951     0.998242       753513       568.89
    4399.103     0.998437       753669       640.00
    4448.255     0.998633       753810       731.43
    4497.407     0.998828       753957       853.33
    4538.367     0.999023       754107      1024.00
    4558.847     0.999121       754184      1137.78
    4571.135     0.999219       754246      1280.00
    4587.519     0.999316       754326      1462.86
    4603.903     0.999414       754401      1706.67
    4628.479     0.999512       754467      2048.00
    4644.863     0.999561       754514      2275.56
    4657.151     0.999609       754541      2560.00
    4681.727     0.999658       754577      2925.71
    4702.207     0.999707       754618      3413.33
    4722.687     0.999756       754659      4096.00
    4730.879     0.999780       754677      4551.11
    4734.975     0.999805       754687      5120.00
    4747.263     0.999829       754716      5851.43
    4751.359     0.999854       754726      6826.67
    4759.551     0.999878       754747      8192.00
    4763.647     0.999890       754756      9102.22
    4767.743     0.999902       754764     10240.00
    4771.839     0.999915       754772     11702.86
    4775.935     0.999927       754779     13653.33
    4780.031     0.999939       754788     16384.00
    4784.127     0.999945       754795     18204.44
    4788.223     0.999951       754801     20480.00
    4792.319     0.999957       754808     23405.71
    4792.319     0.999963       754808     27306.67
    4796.415     0.999969       754814     32768.00
    4796.415     0.999973       754814     36408.89
    4800.511     0.999976       754819     40960.00
    4800.511     0.999979       754819     46811.43
    4804.607     0.999982       754824     54613.33
    4804.607     0.999985       754824     65536.00
    4804.607     0.999986       754824     72817.78
    4808.703     0.999988       754826     81920.00
    4808.703     0.999989       754826     93622.86
    4841.471     0.999991       754829    109226.67
    4841.471     0.999992       754829    131072.00
    4841.471     0.999993       754829    145635.56
    4845.567     0.999994       754832    163840.00
    4845.567     0.999995       754832    187245.71
    4845.567     0.999995       754832    218453.33
    4845.567     0.999996       754832    262144.00
    4845.567     0.999997       754832    291271.11
    4845.567     0.999997       754832    327680.00
    4845.567     0.999997       754832    374491.43
    4849.663     0.999998       754834    436906.67
    4849.663     1.000000       754834          inf
#[Mean    =     1875.841, StdDeviation   =      903.072]
#[Max     =     4845.568, Total count    =       754834]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  905859 requests in 1.00m, 146.86MB read
Requests/sec:  15092.48
Transfer/sec:      2.45MB